{
    "project": "MeetWhen",
    "branchName": "ralph/multiple-availability-intervals",
    "description": "Multiple Time Intervals in Custom Availability - Allow hosts to define up to 2 time intervals per day (e.g., morning 9:00-12:00 and afternoon 14:00-17:00) for accommodating lunch breaks or split schedules",
    "userStories": [
        {
            "id": "US-001",
            "title": "Update data structure for multiple intervals",
            "description": "As a developer, I need to extend the availability rules data structure to support multiple intervals per day so that the backend can store and process them.",
            "acceptanceCriteria": [
                "DayAvailability struct in availability.go supports a slice of intervals instead of single start/end",
                "parseAvailabilityRules() handles both old format (single start/end) and new format (intervals array)",
                "JSON structure supports: { \"days\": { \"1\": { \"enabled\": true, \"intervals\": [{\"start\": \"09:00\", \"end\": \"12:00\"}, {\"start\": \"14:00\", \"end\": \"17:00\"}] } } }",
                "Existing templates with old format continue to work (backward compatible)",
                "Typecheck passes"
            ],
            "priority": 1,
            "passes": true,
            "notes": "Implemented in commit 1942e30. Added TimeInterval struct, modified DayAvailability to use Intervals slice, and updated both parseAvailabilityRules() and getSlotsForDay() to handle multiple intervals per day while maintaining backward compatibility with old format."
        },
        {
            "id": "US-002",
            "title": "Update slot generation to use multiple intervals",
            "description": "As a developer, I need to update the availability calculation to generate slots from all intervals so that bookings can be made in any defined time period.",
            "acceptanceCriteria": [
                "getSlotsForDay() iterates through all intervals for a day",
                "Slots are generated within each interval independently",
                "All slots are combined and returned sorted by start time",
                "Unit tests cover: single interval, two intervals, empty intervals",
                "Typecheck passes"
            ],
            "priority": 2,
            "passes": true,
            "notes": "Implementation was completed as part of US-001. Added comprehensive unit tests covering: single interval, two intervals, empty intervals, day disabled, working hours fallback, template rules disabled, busy time blocking, earliest start constraint, slot overlap detection, and time slot merging."
        },
        {
            "id": "US-003",
            "title": "Update UI to support multiple intervals per day",
            "description": "As a host, I want to add a second time interval for each day so that I can block out lunch breaks or other unavailable periods.",
            "acceptanceCriteria": [
                "Each enabled day shows its current interval(s)",
                "Add interval button appears when a day has fewer than 2 intervals",
                "Remove button appears on each interval (except the first one when only one exists)",
                "Time inputs for start/end on each interval",
                "Maximum of 2 intervals per day enforced",
                "Typecheck passes",
                "Verify in browser using dev-browser skill"
            ],
            "priority": 3,
            "passes": true,
            "notes": "Implemented in commit aea68b7. Rewrote availability section to render days dynamically via JavaScript. Added 'Add interval' button, 'Remove' button, time inputs for each interval. Maximum 2 intervals enforced via MAX_INTERVALS_PER_DAY constant. Backward compatible with old single start/end format."
        },
        {
            "id": "US-004",
            "title": "Implement smart defaults for second interval",
            "description": "As a host, when I add a second interval, I want sensible default times so I don't have to manually set everything from scratch.",
            "acceptanceCriteria": [
                "When first interval ends at or before 12:00, second interval defaults to 13:00-17:00",
                "When first interval ends after 12:00, second interval defaults to first interval end time + 1 hour, for 3 hours duration",
                "Default times are editable immediately after adding",
                "Typecheck passes",
                "Verify in browser using dev-browser skill"
            ],
            "priority": 4,
            "passes": true,
            "notes": "Already implemented in commit aea68b7 as part of US-003. The addInterval() JavaScript function in dashboard_template_form.html contains the smart defaults logic: if first interval ends <= 12:00, defaults to 13:00-17:00; otherwise starts 1 hour after first interval ends for 3 hours (capped at 23:00)."
        },
        {
            "id": "US-005",
            "title": "Implement interval overlap validation",
            "description": "As a host, I want to be prevented from saving overlapping intervals so that my availability is always valid.",
            "acceptanceCriteria": [
                "Frontend validates intervals don't overlap before form submission",
                "If intervals overlap, show inline error message below the day's intervals",
                "Overlap check: interval A overlaps B if A.start < B.end AND A.end > B.start",
                "Form submission is blocked if any day has overlapping intervals",
                "Typecheck passes",
                "Verify in browser using dev-browser skill"
            ],
            "priority": 5,
            "passes": true,
            "notes": "Implemented in commit bcce2a8. Added intervalsOverlap() helper function using the formula A.start < B.end && A.end > B.start. Added validateIntervals() function that checks all interval pairs for each enabled day. Inline error messages displayed below day intervals with CSS styling. Form submission blocked via e.preventDefault() when overlaps detected. Validation runs on form submit and on every interval time change for immediate feedback."
        }
    ]
}
